Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: I want you to sing.
jbo: mi djica lo nu do sanga

source: Where are the apples?
jbo: loi plise cu zvati ma

source: I don't want to be late.
jbo: mi na lerci djica

source: Are you awake?
jbo: xu do cikna

source: Goodnight!
jbo: xamgu nicte di'ai

source: I have no appetite.
jbo: mi na'e xagji djica

source: I'm sure he'll go.
jbo: ju'o ra ba klama

source: Could I borrow a pencil?
jbo: .e'apei mi jbera lo pinsi

source: He can't help you.
jbo: .i ri na kakne lonu sidju

source: I think, keeping promises is important.
jbo: sei mi jinvi lo nu gasnu lo se nupre cu vajni

source: A is enough, but B is not enough.
jbo: .abu banzu .ijeku'i by. na go'i

source: A cat was on the table.
jbo: lo mlatu le jubme cu cpana

source: Approximately two weeks.
jbo: jeftu be li ji'ire

source: My father isn't at home.
jbo: lo patfu be mi ku na zvati lo zdani

source: The stars shone in the sky.
jbo: za'u tarci pu gusni carmi bu'u lo tsani

source: He, who kicks the pillar that stands on the bridge that leads over the river that flows through the village, in which lives the man, who owns the collar that bestows magical powers that perform miracles, dies.
jbo: ra noi tikpa le kamju poi sanli le cripu be le rirxe poi pagre le cmatca noi se zdani le nanmu poi ponse le karli poi rinka lo nu makfa vlipa cu mrobi'o

source: The principal shook hands with each of the graduates.
jbo: le ralju cu xanjairinsa lo kulmu'o

source: I love my family so much.
jbo: .iu mi prami le lanzu be mi

source: Such a wonderful music!
jbo: .ui melbi zgike

source: This house is my father's.
jbo: vi zdani lo patfu be mi

source: Natasha is a Russian name.
jbo: la .natacas. cu rusko cmene

source: Carmen is a Spanish name.
jbo: la .karmen. cu spano cmene

source: Teresa is a Portuguese name.
jbo: la .teresas. cu porto cmene

source: Helga is a Swedish name.
jbo: la .xelga. cu sfe'ero cmene

source: Steve is an American name.
jbo: la'oi Steve mergu'e cmene

source: Yoko is a Japanese name.
jbo: la .iokos. cu ponjo cmene

source: Are you still in Florida?
jbo: xu do la .flOridas. ca'o zvati

source: Tell us a random travel experience you had that you weren't expecting but loved.
jbo: ko terlisri lo nunlitru poi spaji jeku'i pluka do

source: School violence is a big problem.
jbo: lo ckule vlile cu nadycai

source: I'll definitely do that.
jbo: .ai

source: I'll do that without fail.
jbo: .ai.e'e

source: Tom's dog needed to go outside.
jbo: lo gerku pe la tom pu nitcu lo nu klama lo bartu

source: Tom wrote to Mary about John.
jbo: la .tam. cu ciska tavla la .meris. la .djan.

source: Tom was the one who cooked dinner.
jbo: .i la ba'e .tam. jukpa lo vanci sanmi

source: Tom was killed in a car accident.
jbo: la tom. pu mrobi'o ri'a tu'a lo karcysnuti

source: Tom was happy to be home after being away for so long.
jbo: la .tom. pu gleki zvati le ri zdani ba'o lonu ri ze'uvu zvati

source: Tom wanted to thank Mary in person.
jbo: la tom pu djica lo nu zvati ckire la maris

source: Tom showed no interest in sports.
jbo: la .tam. na jarco lo du'u ri cinri lo xadykelci'e

source: Tom planted some flower seeds in his garden.
jbo: la .tam. pu sombo so'o xrula tsiju lo ty purdi

source: Tom knows a man whose daughter lives in Boston.
jbo: la tom cu se slabu lo prenu noi lo tixnu be ke'a xabju la boston

source: Tom is very capable.
jbo: la tom cu stati mutce

source: Tom is a close relative of mine.
jbo: la tom. jibni se lanzu seki'i mi

source: Tom filled the bucket with cold water.
jbo: la .tam. pu clugau lo baktu lo lenku djacu

source: Tom felt someone touch his arm.
jbo: la tom. goi ko'a pu ganse lo ka pecybi'o le ko'a birka

source: Tom eats at least three bowls of rice every day.
jbo: la .tom. cu citka ca ro djedi su'o ci taslai poi rismi

source: Tom doesn't trust anyone.
jbo: la tom cu lacri da naku

source: Tom doesn't care what happens to Mary.
jbo: la tom na se vajni lo nu la maris cu jai fasnu fai makau

source: Tom didn't understand a word Mary said.
jbo: la tom na jimpe fi lo se cusku pe la maris

source: Tom demanded an explanation.
jbo: la tom pu mi'ecpe lo velcki

source: Tom can eat just about anything.
jbo: la tom kakne lo nu citka roda

source: Tom broke into our conversation.
jbo: la tom pu zunti lo mi'ai se casnu

source: Tom became famous as a violinist.
jbo: la .tom. pumo'u jgita misno

source: Tom always forgives Mary, no matter what she does.
jbo: .i la. tam. roroi fraxu la. meris. fi'o nalvai lo my. selzu'e

source: There's nothing more I can tell you.
jbo: .i naku za'uda zo'u mi do da jungau

source: I think I've forgotten something.
jbo: mi pensi lo du'u mi tolmorji da

source: I hope you feel better tomorrow.
jbo: .a'o do kanryze'a ca lo bavlamdei

source: Michael Jackson was a whisky expert.
jbo: la maik,l. djaks,n. .uiski certu

source: As for America, Mr. Smith came.
jbo: lo gugde'usu zo'u la naun. smit. pu klama

source: What are you eating?
jbo: do citka ma

source: Greetings, old friend!
jbo: coi .i'u

source: What I am commanding you to do?
jbo: ko mo

source: What did I tell you to do?
jbo: ko mo

source: How certain are you that he's a criminal?
jbo: ju'opei zergau

source: I say "Hi, friend.".
jbo: mi cusku lu coi pendo li'u

source: I said that I was confused.
jbo: mi pu jetnu cusku zo ki'a

source: Xalbo, who are you talking to?
jbo: doi la .xalbo. ma te cusku fi do

source: I talk to you.
jbo: mi tavla do

source: You talk to me about that.
jbo: do tavla mi ta

source: I sell this to you.
jbo: mi cu vecnu ti do

source: That is beautiful.
jbo: ta cu melbi

source: I talk to you about this.
jbo: mi tavla do ti

source: I go quickly to Mary.
jbo: mi cu sutra klama la meris.

source: This is spaghetti.
jbo: ti cu djarspageti

source: The dog is beautiful.
jbo: le gerku ku cu melbi

source: This pleases me.
jbo: ti cu pluka mi

source: My dog is fast.
jbo: le mi gerku cu sutra

source: Hey, John.
jbo: doi .djan.

source: Who is talking to you about me?
jbo: ma tavla do mi

source: What are you talking to?
jbo: do cu tavla ma

source: You're what?
jbo: do cu mo

source: Are you healthy?
jbo: xu do kanro

source: Yeah, Ill go.
jbo: .ie mi cu klama

source: John went to the store.
jbo: la .djan. pu klama le zarci

source: You are my mother.
jbo: do mamta mi

source: You are my father.
jbo: do patfu mi

source: That is a boat.
jbo: ta bloti

source: That is a ship.
jbo: ta brablo

source: That is a schooner.
jbo: ta blotrskunri

source: That's a lemon tree.
jbo: tu pelnimre tricu

source: John is a big boy.
jbo: la .djan. barda nanla

source: I run quickly.
jbo: mi sutra bajra

source: You are a large person.
jbo: do barda prenu

source: You are a small person.
jbo: do cmalu prenu

source: That's a blue house.
jbo: ta blanu zdani

source: This is a good house.
jbo: ti xamgu zdani

source: That is a blue house.
jbo: ta zdani co blanu

source: I try to go to the market from the house.
jbo: mi troci co klama le zarci le zdani

source: I go quickly.
jbo: mi klama co sutra

source: John goes to the market.
jbo: la .djan. klama le zarci

source: Preem Palver is the first speaker.
jbo: la .prim. .palvr. pamoi cusku

source: Anyi and Asun are two brothers.
jbo: la .an,iis. joi la .asun. cu bruna remei

source: You are John.
jbo: do du la .djan.

source: That is a Chrysler car.
jbo: ta me lai .kraislr. meu karce

source: Alice didnt walk to the market.
jbo: la .alis. cu nae cadzu klama le zarci

source: Jones is not the first speaker.
jbo: la .djonz. cu nae pamoi cusku

source: I went to the market.
jbo: mi pu klama le zarci

source: Jones isnt the first speaker.
jbo: la djonz. na pamoi cusku

source: Please support Lojban!
jbo: eosai ko sarji la .lojban.

source: This is three meters long.
jbo: ti mitre li ci

source: The market is big.
jbo: le zarci cu barda

source: The man is a woman.
jbo: le nanmu cu ninmu

source: Frank eats some cheese.
jbo: la .frank. pu citka lo cirla

source: A bear wrote the story.
jbo: lo cribe pu finti le lisri

source: A human being wrote the story.
jbo: lo remna pu finti le lisri

source: The person carried the piano.
jbo: le prenu cu bevri le pipno

source: Butter is soft.
jbo: loi matne cu ranti

source: Rats are small.
jbo: loi ratcu cu cmalu

source: I am a typical Lojban user.
jbo: mi fadni zo'e lo'i lobypli

source: You walk on the ice.
jbo: do cadzu le bisli

source: Hello, girl with the red dress!
jbo: coi xunre pastu nixli

source: Goodbye, Bob and Nora.
jbo: co'o la .bab. .e la .noras.

source: John, come to me!
jbo: doi .djan. ko klama mi

source: The Joneses go to the store.
jbo: lai .djonz. cu klama le zarci

source: My name is John.
jbo: zo .djan. cmene mi

source: I say, Im John.
jbo: mi cusku lu mi'e djan. li'u

source: I had sex with a Soviet-American woman.
jbo: mi gletu lo softo merko ninmu ku

source: I said a complex tanru.
jbo: mi pluja tanru cusku

source: I know that cntrational is interested in Lojban.
jbo: mi djuno lo du'u la'oi cntrational se cinri la lojban

source: I am English in that I eat biscuits.
jbo: mi glico lo nu mi citka la cidjrbiskit

source: Are you Chinese?
jbo: xu do jungo

source: Is your coworker an American?
jbo: lo gunkansa pe do merko xu

source: The teacher is Chinese.
jbo: lo ctuca cu jungo

source: Chen is not American.
jbo: la .tcyn. na merko

source: Those students are Korean.
jbo: lo vu tadni natmrxanguke

source: Is your father a businessperson?
jbo: xu lo patfu po do cu'upre

source: Im Korean.
jbo: mi natmrxanguke

source: I am Korean.
jbo: mi natmrxanguke

source: Is he Malaysian?
jbo: xu meljo

source: Chen is not a businessperson.
jbo: la .tcyn. na cu'upre

source: Chen is not a university student.
jbo: la .tcyn. na balcu'e tadni

source: Are you Chinese, sir?
jbo: xu ga'inai do jungo

source: Chen is not Korean.
jbo: la .tcyn. na natmrxanguke

source: Chen is a teacher.
jbo: la .tcyn. ctuca

source: He is a university student.
jbo: balcu'e tadni

source: I am not Canadian.
jbo: mi na kadno

source: I am not a businessperson.
jbo: mi na cu'upre

source: I like China.
jbo: mi nelci le jugygu'e

source: He really likes the United States.
jbo: mutce nelci lo mergu'e

source: Do you like tea?
jbo: xu do nelci lo tcati

source: I don't like this book.
jbo: mi na nelci lo vi cukta

source: I like your friend very much.
jbo: mi mutce nelci lo pendo po do

source: Do you like your boss?
jbo: xu do nelci lo jatna po do

source: Does your friend like tea?
jbo: xu lo pendo po do nelci lo tcati

source: I like perfume tea.
jbo: mi nelci lo panci tcati

source: I also like perfume tea.
jbo: ji'a mi nelci lo panci tcati

source: I like the teacher.
jbo: mi nelci lo ctuca

source: I really like China.
jbo: mi mutce nelci le jugygu'e

source: Does he like China?
jbo: xu nelci le jugygu'e

source: He likes tea.
jbo: nelci lo tcati

source: Do you like your classmates?
jbo: xu do nelci lo tadni kansa pe do

source: Do you like this book?
jbo: xu do nelci lo vi cukta

source: Yang doesn't like my friend.
jbo: la .ian. na nelci lo pendo mi

source: Do you like Chinese food?
jbo: do nelci lo jungo cidja xu

source: I don't like tea.
jbo: mi na nelci lo tcati

source: Do you like your coworkers?
jbo: do nelci lo gunkansa pe do xu

source: I really like my coworkers.
jbo: mi mutce nelci lo gunkansa pe mi

source: He likes this book.
jbo: nelci lo vi cukta

source: Do you like my friend?
jbo: xu do nelci lo pendo pe mi

source: Do you like school?
jbo: xu do nelci lo ckule

source: The students don't like school.
jbo: lo tadni na nelci lo ckule

source: Do you like Korean food?
jbo: do nelci lo kulnrxanguke cidja xu

source: I really like it, too.
jbo: ji'a mi mutce nelci

source: Where is the metro St. Michel?
jbo: le la .sen.micel. renytcana cu zvati ma

source: We are at the boulevard St. Michel.
jbo: mi'o zvati le la .sen.micel. klaji

source: The fountain is over there.
jbo: lo tu je'erjinto

source: There is the Seine and here is the bridge.
jbo: tu du la .sen. gi'e ti cripu

source: The metro's not on the left, so it's on the right.
jbo: le renytcana na zvati lo zunle ja'o ra zvati lo pritu

source: There it is.
jbo: zvati ta

source: The metro is on the right!
jbo: le trene zvati lo pritu

source: I'm a tourist, too!
jbo: ji'a mi datygugvi'e

source: I'm a tourist too.
jbo: ji'a mi datygugvi'e

source: I am in Paris.
jbo: mi zvati la .paris.

source: We are in Paris.
jbo: mi'a zvati la .paris.

source: There is the fountain and here is the metro.
jbo: vu je'erjinto gi'e ti renytcana

source: But where are we?
jbo: .i ku'i mi'o zvati ma

source: We are in the forest.
jbo: mi'o zvati le ricfoi

source: That's a tree.
jbo: ta tricu

source: Yes, but that?
jbo: .ie .i ku'i ta mo

source: That's only an elk.
jbo: ta mirli ra'unai

source: We are here.
jbo: mi'o vi

source: What species of elk is it?
jbo: mirli ma

source: It costs 2 euros.
jbo: lo ronru'u be li re cu jdima

source: I'm eating now.
jbo: mi citka ca ku

source: I ate.
jbo: mi pu citka

source: I will eat.
jbo: mi ba citka

source: I eat to the north of your house.
jbo: mi citka be'a le zdani be do

source: He jumps far away from me.
jbo: vu mi plipe

source: Far away from you, I sleep.
jbo: vu bu'u do mi sipna

source: He sang a long time ago.
jbo: pu zu sanga

source: I sang for two hours.
jbo: mi sanga ze'a lo cacra be li re

source: I ran for a mile.
jbo: mi bajra ve'a lo minli be li

source: I drank a liter of coffee.
jbo: mi pinxe lo ckafi be ve'u lo litce

source: I have never loved you.
jbo: mi ze'epu noroi prami do

source: The Doctor travels through all space and time.
jbo: la mikce cu ze'e ve'e litru

source: Thank you for greeting me.
jbo: ckire fi lo nu rinsa mi

source: I am done teaching.
jbo: mi mo'u ctuca

source: I'll start swimming very soon.
jbo: mi ba zi co'a limna

source: Bananas are delicious.
jbo: lo badna ku kukte

source: I eat an apple.
jbo: mi citka lo plise ku

source: That's a party.
jbo: tu nu salci kei

source: This is me eating a banana.
jbo: ti nu mi citka lo badna ku kei

source: I know that you are learning Lojban.
jbo: mi djuno lo du'u do cilre fi la lojban kei ku

source: I remembered that you were my brother.
jbo: mi morji lo du'u do bruna mi kei ku

source: I know that Lojban is good for you.
jbo: mi djuno lo du'u la .lojban. xamgu do kei

source: People believe that god exists.
jbo: lo prenu ku krici lo du'u lo cevni ku zasti kei ku

source: Have you finished your meal?
jbo: xu do ba'o citka

source: Ramudu came to school.
jbo: la ramudus klama lo ckule

source: Give this to Ramu.
jbo: ko ti dunda la ramus.

source: She is a beautiful woman.
jbo: ko'a me lo melbi ninmu

source: Is it an elk?
jbo: xu mirli

source: They say it will rain.
jbo: ti'e ba carvi

source: You saved my life.
jbo: do pu nurxru mi

source: I don't want to go to school.
jbo: .aunai mi klama lo ckule

source: Does Tom always carry a gun?
jbo: xu la tom. roroi bevri lo celxa'i

source: The sun is the king of the sky, the moon is the queen of the stars.
jbo: pe'a lo solri ku noltrunau lo tsani ije lo lunra ku noltruni'u loi tarci

source: Sorry!
jbo: .u'u

source: I believe you know what Marcus is doing.
jbo: mi krici lo nu do djuno lo nu la markus cu zukte makau

source: The deer was killed by hunters.
jbo: lo mirli cu se catra loi kalte

source: My cat is wet.
jbo: lo mi mlatu cu cilmo

source: He was my friend.
jbo: pu pendo mi

source: The brother wrote a letter to the sister.
jbo: lo bruna pu ciksa lo xatra be lo mensi

source: Maybe they are happy.
jbo: lo du'u zo'e gleki ku cumki

source: How many died?
jbo: xo co'a morsi

source: I'm not stupid.
jbo: mi na tolmencre

source: Attention, Lojbanist!
jbo: ju'i jbopli

source: Joaqun is from Argentina. He is Argentinian.
jbo: la xuaKIN. se krasi lo gugde'aru .i xy. gento

source: Laura is from Brazil. She is Brazilian.
jbo: la .lauras. se krasi lo razgu'e .i ra brazo

source: This is bad.
jbo: ti xlali

source: I'm here to save you.
jbo: mi zvati ti tezu'e lo ka snurygau do

source: She's drop-dead gorgeous.
jbo: ko'a mutce melbi

source: I'm scared.
jbo: mi ca'o terpa

source: You're coming with me.
jbo: ko klama ka'ai mi

source: What is wrong with you?
jbo: .uanai ma mukti do .o'onai

source: Will he live?
jbo: xu ta ba ca'o jmive

source: That's not what I meant.
jbo: na se smuni fi mi

source: They are happy about the result.
jbo: ko'a gleki lo jalge

source: You are happy about the result.
jbo: do gleki lo jalge

source: We are in a library.
jbo: mi'a nenri lo ckuzda

source: These paintings are different sizes.
jbo: za'u lo vi pixra cu simxu frica fi lo ni barda

source: This sentence is not in English.
jbo: lo vi jufra na glico

source: Are you dead?
jbo: xu do morsi

source: It's monkey meat.
jbo: rectu lo smani

source: 2539 is a prime number.
jbo: li remuciso mulna'usle

source: I'm incredibly tired.
jbo: mi nalcumki tatpi

source: I'm important.
jbo: mi jai vajni

source: I'm fat.
jbo: mi plana

source: She's fixing the machine.
jbo: ra cikre lo minji

source: I want to have sex with her.
jbo: .au mi gletu ra

source: Children watch adults.
jbo: lo verba ku zgana lo makcu

source: I like to go to the chat room.
jbo: mi nelci lo nu klama lo tavla kumfa

source: I like hot food, you like cold food, and Jane likes lukewarm food.
jbo: mi nelci loi glare cidja .i je do nelci to'ebo ri .i je la djein. nelci no'ebo ra

source: The bear bites itself.
jbo: le cribe cu batci vo'a

source: I am John, Frank. I tell you I run.
jbo: mi'e djan. doi frank. mi cusku lu mi bajra li'u do

source: Go to the store!
jbo: ko klama le zarci

source: Be seen by me!
jbo: mi viska ko

source: Show yourself!
jbo: mi viska ko

source: Show me the person who loves you.
jbo: mi viska le prenu poi prami ko

source: You dont like cats and that is untrue.
jbo: do na nelci loi mlatu .i di'u jitfa jufra

source: I love Jane, and I like that.
jbo: mi prami la djein. .i mi nelci la'e di'u

source: Alice sleeps in her room.
jbo: la .alis. sipna le ri kumfa

source: I love myself.
jbo: mi prami mi

source: Is John your name?
jbo: xu zo djan. cmene do

source: Give the money to my son.
jbo: ko dunda le jdini le mi bersa

source: Give the house to my daughter.
jbo: ko dunda le zdani le tixnu

source: I will go when you do.
jbo: mi ba klama ca le nu do no'a

source: I will wash my car.
jbo: mi ba lumci lemi karce

source: Living things are made from cells.
jbo: loi jmive cu se zbasu zi'o loi selci

source: I make the building out of wood.
jbo: mi zbasu le dinju loi mudri

source: I see a cat made of plastic.
jbo: mi catlu lo mlatu poi zbasu ke'a lei slasi

source: John picked up a stick and shook it.
jbo: la djan. cu lafti da poi grana ku'o gi'e desygau da

source: I'm happy about talking to you.
jbo: mi gleki lo nu tavla do

source: I like that it is soft.
jbo: mi nelci lo nu ranti

source: Eating pleases me.
jbo: lo nu citka kei cu pluka mi

source: I'm not trying to destroy.
jbo: mi na troci lo nu daspo

source: I want to eat meat and vegetables.
jbo: mi djica lo nu citka lo rectu .e lo stagi

source: Do you need to drink wine?
jbo: xu do nitcu lo nu pinxe lo vanju

source: I need to travel.
jbo: mi nitcu lo nu litru

source: I'm waiting and hoping for Alex to come.
jbo: mi denpa je pacna lo nu la .alex. klama

source: I want to not say hi.
jbo: mi djica lo nu na cusku zo coi

source: I'm an experienced fogey in tiredness.
jbo: mi tolci'o le nu mi tatpi

source: The seasoned bread causes farts.
jbo: le tsapi nanba cu rinka lo nu gaxykafke

source: Because of the snow, it cannot be done.
jbo: ki'u lo nu snime kei na kakne

source: You made someone eat food.
jbo: do zukte le nu citka le cidja

source: I want to talk in Lojban.
jbo: mi djica lo nu lojbo bacru

source: It's hard for me, reading letters on the monitor.
jbo: nandu mi fa le nu tcidu lo lerfu pe le vidni

source: I think about something leaving.
jbo: mi pensi zo'e pe lo nu cliva

source: I think about what the leaving had.
jbo: mi pensi zo'e pe lo nu cliva

source: Hey, Zgana, how old are you?
jbo: .i doi zgana lo nu do jmive cu nanca li xo

source: He fails at work.
jbo: fliba lo nu gunka

source: I don't like high heat.
jbo: mi na nelci lo nu mutce glare

source: Damn, Valsi isn't here.
jbo: mabla nu la valsi ku na zvati

source: What is your method for discovering?
jbo: ma tadji lo nu do facki

source: Trying is good.
jbo: lo nu troci cu xamgu

source: Right now, I want to speak Lojban.
jbo: caku mi djica lo nu tavla fo lo jbobau

source: He wrote the story about the things that happened before he lived.
jbo: finti lo lisri be loi fasnu be pu lo nu jmive

source: I heard someone shouting.
jbo: mi tirna lo nu zo'e ki'asku

source: Are you all lost?
jbo: xu ro do pu farcri

source: I no longer have a home.
jbo: mi na za'o se zdani

source: The translation of this sentence is a bad translation.
jbo: lo xe fanva be dei cu xlali xe fanva

source: Do you eat enchiladas?
jbo: xu do citka la'o sy enchiladas sy

source: That car is really expensive.
jbo: le va karce cu mutce le jdima

source: Help me!
jbo: ko sidju mi

source: Her voice sounds better than yours.
jbo: lo ko'a voksa cu sance xagmau lo do voksa

source: On the contrary, I think it may turn out that this rugged mountain range trails off at some point.
jbo: tolmi'u ru'a lo ta rufsu cmalinsi cu fanmo

source: The coffee is bitter.
jbo: lo ckafi cu kurki

source: Junko is a beautiful girl.
jbo: la'oi djunko melbi nixli

source: Did you speak with him about your projects?
jbo: xu do ra pu tavla le do gungunma

source: I think my girlfriend is kind of cute.
jbo: pe'i lo selpa'i be mi cu mlimelbi

source: Let's dance.
jbo: ko e mi dansu

source: Tom would like some coffee.
jbo: la .tom. cu djica tu'a lo ckafi

source: Tom wants a detailed explanation.
jbo: la .tam. djica lo nu tilcfu ciksi

source: Tom wanted to wash his hands.
jbo: la .tam. djica lo nu lumci lei xance

source: Tom wanted to talk about something else.
jbo: la .tam. djica lo nu casnu na'ebo da

source: Tom wanted to see Mary happy.
jbo: la .tam. cu djica lo nu la .meris. cu gleki

source: Tom wanted to make a change.
jbo: la .tam. pu djica lo nu galfi

source: Tom wanted to buy it.
jbo: la tom pu djica lo nu terve'u

source: If "every rule has at least one exception" is a rule, then at least one rule has no exception.
jbo: ganai lo du'u fi ro da poi javni fa de nafselte'i ku javni gi da'o da poi javni fi node nafselte'i

source: You can swim, but I can't.
jbo: .e'e do limna .i .e'enai mi limna

source: I ate at the side of my friend.
jbo: mi pu citka ne'a lo pendo be mi

source: Rhinoceros is not a dinosaur.
jbo: lo zbiseljirna na dinsauru

source: It doesn't surprise me that you know.
jbo: .i na spaji mi fa lo nu do djuno

source: We like when you dance!
jbo: mi'a nelci lo nu do dansu

source: Give me five minutes to finish the last adjustments.
jbo: ko curmi lo nu ze'e mu mentu mi mulgau lo nu tikygau

source: But you have never spoken to me about that!
jbo: ku'i do noroi tavla mi ta

source: Isn't it true?
jbo: pei na jetnu

source: It's up to you to decide what to do.
jbo: ba'e do jdice lo ka zukte makau

source: Sorry, I don't understand.
jbo: je'e nai .i mi na jimpe

source: It snows hard.
jbo: ca carmi ke snime carvi

source: Are you her friend?
jbo: pei do pendo ci'a

source: Do you know the family?
jbo: pei do se slabu le lanzu

source: She is Japanese.
jbo: ta ponjo

source: Tom sharpened a pencil.
jbo: la .tom. pu kilgau lo pinsi

source: Tom seems to be sick.
jbo: la .tom. cu simlu lo ka bilma

source: Tom seems to be in good health.
jbo: la .tom. cu simlu lo ka kanro

source: Tom said he wanted to eat Chinese food.
jbo: la .tam. pu cusku lo sedu'u ty djica lo la citka loi jungo cidja

source: Tom opened a window.
jbo: la .tom. pu kargau lo canko

source: Tom knows how to get there.
jbo: la tom cu djuno lo du'u mo'u klama ti ta'i makau
